[
  {
    "Company": "Olympus",
    "DateRange": "2024 - Present",
    "JobRole": "Product Designer IV",
    "CompanyIcon": "src/img/companyIcons/companyIcon_olympus.png",
    "JobDescription": "<p>Olympus, once known for its cameras, now leads in medical imaging innovation. Since 2024, I’ve been designing software that helps doctors, nurses, and clinical teams harness the full potential of Olympus' advanced hardware—making life-saving tools more intuitive, efficient, and impactful at the point of care.</p>",
    "Images": [
      "path/to/image1.jpg",
      "path/to/image2.jpg"
    ],
    "URL": "https://olympus.com"
  },
  {
    "Company": "Cavnue",
    "DateRange": "2022 - 2023",
    "JobRole": "Staff Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_cavnue.png",
    "JobDescription": "<p>Cavnue is on a mission to bridge the gap between current autonomous vehicle capabilities and the promised future of full self-driving.</p><p>When I was brought on to the product team, our main goal was to take the overwhelming amount of data generated by Cavnue's hardware system and surface it in a way that was valuable to our end user.</p>",
    "Images": [
      "path/to/image1.jpg",
      "path/to/image2.jpg"
    ],
    "URL": "https://cavnue.com"
  },
  {
    "Company": "Revel",
    "DateRange": "2019 - 2022",
    "JobRole": "Senior Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_revel.png",
    "JobDescription": "<p>I joined Revel as their first designer in the Summer of 2019 - a pivotal time in the company's growth. I was tasked with designing a full suite of internal tools that would allow the company to bring all their operations and logistics in-house.</p><p>I worked closely with nearly every department lead in the company to ensure that the tools we built met the needs of all who'd be using it. As a result, once we released the tools, we saw a huge spike in productivity and financial efficiency.</p><p>In addition to internal tools, I was a key stakeholder on a number of user-facing, high-revenue initiatives. For example, I led design for a unique, passenger facing tablet in the run-up to the launch of Revel's rideshare program in an effort to rise above the existing players in the market, flexing our position as a car-service provider that owned the end to end experience. I also designed the sign-up, purchase funnel, and user dashboard experience for Revel's electric bike rental program.</p>",
    "Images": [
      "path/to/image3.jpg",
      "path/to/image4.jpg"
    ],
    "URL": "https://gorevel.com"
  },
  {
    "Company": "Nearpod (Acquisition)",
    "DateRange": "2019",
    "JobRole": "Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_nearpod.png",
    "JobDescription": "<p>Continued my responsibilities from Flocabulary. Integrated Nearpod's brand assets into Flocabulary's existing design system.</p>",
    "Images": [
      "path/to/image5.jpg",
      "path/to/image6.jpg"
    ],
    "URL": "https://nearpod.com"
  },
  {
    "Company": "Flocabulary",
    "DateRange": "2018-2019",
    "JobRole": "Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_flocabulary.png",
    "JobDescription": "<p>Flocabulary produces educational hip hop to engage students on a variety of curricula. For my part, as a product designer, I helped build a suite of pedagogical tools, games, and activities that served to supplement the lessons learned through the hip hop songs shown to students.</p><p>During my time with the company I lead design on a variety of exciting, highly-engaging features both for students and teachers, as well as facilitated incisive and illuminating user interviews that helped us target crucial user needs and improve our products' performance.</p>",
    "Images": [
      "path/to/image7.jpg",
      "path/to/image8.jpg"
    ],
    "URL": "https://flocabulary.com"
  },
  {
    "Company": "Propel ML (Startup)",
    "DateRange": "2018",
    "JobRole": "Lead Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_propel.png",
    "JobDescription": "<p>Led design on Javascript-based machine learning, in-browser notebook. Designed browser-based tools that allow engineers to develop ML models in JavaScript, and use differential programming directly in the browser or in Node.js.</p>",
    "Images": [
      "path/to/image9.jpg",
      "path/to/image10.jpg"
    ],
    "URL": "https://github.com/propelml/propel"
  },
  {
    "Company": "Diligent",
    "DateRange": "2016-2018",
    "JobRole": "Product Designer",
    "CompanyIcon": "src/img/companyIcons/companyIcon_diligent.png",
    "JobDescription": "<p>Diligent’s SaaS B2B platform enables boardroom leaders to securely access millions of documents through a single platform.</p><p>During my time on the product team at Diligent I lead design on a variety of platform specific tools (iOS, Android, MacOS, Windows) that unlocked a variety of features for leadership teams at some of the biggest names on the S&P 500.</p><p>A major initiative I led while I was at Diligent was the creation of a progressive web app which had parity with our pre-existing, platform specific software. Porting our features to the web unlocked a huge opportunity for our users to access Diligent’s platform from anywhere, regardless of their OS or device. Additionally, we were able to build a more robust continuous integration / continuous delivery (CI/CD) pipeline which turbocharged our release cycle.</p><p>This was a huge undertaking that taught me a lot about project management, asynchronous collaboration, feature prioritization, and, above all, the virtue of strategic compromise and how it can lead to better results in the long run.</p>",
    "Images": [
      "path/to/image11.jpg",
      "path/to/image12.jpg"
    ],
    "URL": "https://diligent.com"
  },
  {
    "Company": "Google [x]",
    "DateRange": "2013-2014",
    "JobRole": "Mapping Designer (contract)",
    "CompanyIcon": "src/img/companyIcons/companyIcon_google.png",
    "JobDescription": "<p>Contributed map layouts to the Google Self-Driving Car project while it was still a secret project under Google[x]. Worked closely with lidar specialists to create geospatial tools that allowed the autonomous technology to achieve maximum spatial awareness.</p>",
    "Images": [
      "path/to/image11.jpg",
      "path/to/image12.jpg"
    ],
    "URL": "https://x.company/projects/waymo/"
  }
]